import { Injectable, OnModuleInit } from '@nestjs/common'
import { Telegraf } from 'telegraf'
import { NotificationService } from '../notification/notification.service'
import { ConfigService } from '../shared/config/config.service'
import { getFormattedText } from '../shared/utils/textFormat.util'

@Injectable()
export class TelegramService implements OnModuleInit {
	private bot: Telegraf

	constructor(
		private configService: ConfigService,
		private notificationService: NotificationService
	) {
		const token = this.configService.getTelegramBotToken()

		this.bot = new Telegraf(token)
	}

	onModuleInit() {
		this.bot.start(ctx => {
			ctx.reply(
				`Привет! Я помогу тебе настроить напоминания! 🎉

Чтобы задать напоминания, просто начни сообщение с временных меток в формате:

[время]-[время]-[время] (или с несколькими тире между временными метками)

где время может быть указано в часах, минутах, днях или неделях.

Примеры:

Напоминания за минуты:

Формат: 10м-5м

Пример: 10м-5м — бот напомнит вам сначала за 10 минут, потом за 5 минут до события.

Напоминания за дни:

Формат: 5д-3д-1д

Пример: 5д-3д-1д — бот напомнит вам сначала за 5 дней, затем за 3 дня, и наконец за 1 день до события.

Смешанные напоминания:

Формат: 10м-1д-2д

Пример: 10м-1д-2д — бот напомнит вам за 10 минут, затем за 2 дня, и наконец за 1 день до события.

Поддерживаемые единицы времени:

м — минуты

ч — часы

д — дни

н — недели

m — minutes (английский эквивалент)

h — hours (английский эквивалент)

d — days (английский эквивалент)

w — weeks (английский эквивалент)

Пример полного сообщения:

10м-5м — напомни за 10 минут и за 5 минут.

5д-3д-1д — напомни за 5 дней, 3 дня и 1 день.

В этом случае бот отправит вам напоминания:

За 10 минут.

За 5 минут.

За 5 дней.

За 3 дня.

За 1 день.

Важно:

Время должно быть разделено дефисами (-). Вы можете использовать любое количество тире — одно или несколько, главное, чтобы они разделяли временные метки.

Используйте правильные единицы времени (м, ч, д, н, или их английские эквиваленты).

Напоминания будут отправляться в том порядке, в котором вы их указали.

Если все готово, отправь мне сообщение с временными метками, и я настрою напоминания для тебя! ⏰`
			)
		})

		this.bot.on('text', async ctx => {
			try {
				const userMessage = ctx.message.text
				const addedNotification =
					await this.notificationService.addNotification(userMessage)

				const message = getFormattedText(addedNotification)
				try {
					await ctx.reply(message, { parse_mode: 'HTML' })
				} catch (jsonError) {
					console.error('Error parsing AI response as JSON:', jsonError)
					ctx.reply(
						'Ответ ИИ не может быть обработан как JSON. Пожалуйста, убедитесь, что формат правильный.'
					)
				}
			} catch (error) {
				console.error('Error in fetching AI response:', error)
				ctx.reply('Извините, что-то пошло не так.')
			}
		})

		this.bot
			.launch()
			.then(() => {
				console.log('Bot started...')
			})
			.catch(err => {
				console.error('Error launching the bot: ', err)
			})
	}

	stopBot() {
		this.bot.stop('SIGINT')
	}
}
